<!-- dflook/terraform-github-actions {"workspace":"default","backend":"2dfe0bec5bf09a00d835b9877f2621227bb2f8c98697d50c6ca290efe5cb3f46","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","plan_job_ref":"Job Test plan target and replace #253 at https://github.com/dflook/terraform-github-actions/actions/runs/3245550357","plan_hash":"30814244f916e8d5632276b1d6cff59f2a00399795dd053fb5a529b55aac4a31","plan_text_format":"text"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "0ZYDbuRAw0" -> (known after apply)
  ~ foreach = "zqUYDnsVqg" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #253](https://github.com/dflook/terraform-github-actions/actions/runs/3245550357)